results/1/server1/apiary-1.2.3/HELLO.log
Benchmarking HELLO
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.39ms   34.86ms   1.48s    99.88%
    Req/Sec    17.13k     3.45k   34.80k    67.60%
  992326 requests in 30.00s, 144.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 282
Requests/sec:  33077.65
Transfer/sec:      4.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.67ms   18.03ms   1.60s    99.67%
    Req/Sec    17.01k     2.87k   28.14k    69.10%
  992298 requests in 30.00s, 144.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 297
Requests/sec:  33076.88
Transfer/sec:      4.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.03ms    8.26ms   1.08s    97.65%
    Req/Sec    16.39k     2.15k   22.24k    61.72%
  969365 requests in 30.00s, 141.44MB read
Requests/sec:  32312.35
Transfer/sec:      4.71MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.18ms  196.94ms   2.47s    99.27%
    Req/Sec    17.31k     4.59k   44.33k    68.85%
  975555 requests in 30.00s, 142.35MB read
  Socket errors: connect 0, read 25, write 0, timeout 136
Requests/sec:  32518.24
Transfer/sec:      4.74MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.26ms   23.49ms   1.59s    99.86%
    Req/Sec    17.43k     3.24k   30.40k    73.17%
  1014664 requests in 30.00s, 148.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 260
Requests/sec:  33820.35
Transfer/sec:      4.93MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.54ms   13.68ms   1.12s    98.30%
    Req/Sec    17.05k     2.84k   29.85k    64.54%
  992340 requests in 30.00s, 144.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 327
Requests/sec:  33077.90
Transfer/sec:      4.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.71ms   35.94ms   1.36s    99.86%
    Req/Sec    17.38k     3.36k   35.21k    70.68%
  1000873 requests in 30.00s, 146.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 588
Requests/sec:  33362.32
Transfer/sec:      4.87MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.84ms   25.61ms   1.67s    99.84%
    Req/Sec    17.21k     3.18k   32.65k    69.30%
  999075 requests in 30.00s, 145.78MB read
  Socket errors: connect 0, read 0, write 0, timeout 162
Requests/sec:  33302.54
Transfer/sec:      4.86MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.17ms   14.97ms   1.60s    99.53%
    Req/Sec    16.88k     2.37k   26.38k    66.24%
  990462 requests in 30.00s, 144.52MB read
  Socket errors: connect 0, read 0, write 0, timeout 78
Requests/sec:  33015.48
Transfer/sec:      4.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/hello-world
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   109.30ms  410.98ms   2.25s    95.41%
    Req/Sec    17.38k     7.83k   44.44k    63.49%
  981692 requests in 30.00s, 143.24MB read
  Socket errors: connect 0, read 0, write 0, timeout 346
Requests/sec:  32721.97
Transfer/sec:      4.77MB
=================== summary ===================
machine:      server1
ghc version:  7.8.4
bench target: apiary-1.2.3
bench:        HELLO
bench mode:   30s * 10
average:      33028.57
stdev:        433.09
=================== oneline ===================
server1,7.8.4,apiary-1.2.3,HELLO,30s,10,33028.57,433.09